app/controllers/ideas_controller.rb

SELECT "comments".* FROM "comments" WHERE "comments"."idea_id" = ?  [["idea_id", 1]]
---
  def show
    @comments = @idea.comments.all

INSERT INTO "ideas" ("name", "discription", "picture", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "leeroy"], ["discription", "bark"], ["picture", ""], ["created_at", "2019-06-08 01:00:29.528142"], ["updated_at", "2019-06-08 01:00:29.528142"]]
---
  def create
    @idea = Idea.new(idea_params)

    respond_to do |format|
      if @idea.save

UPDATE "ideas" SET "picture" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["picture", "54_.jpg"], ["updated_at", "2019-06-08 02:09:53.567369"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @idea.update(idea_params)